#version 150

////////////////////////////////////////////////////////////////////////////////【定数】

layout(std140) uniform TCamera
{
  layout(row_major) mat4 Proj;
  layout(row_major) mat4 Move;
}
_Camera;

layout(std140) uniform TGeomet
{
  layout(row_major) mat4 Move;
}
_Geomet;

////////////////////////////////////////////////////////////////////////////////【入出力】

in TSendVF
{
  vec4 Nor;
}
_Sender;

//------------------------------------------------------------------------------

out vec4 _FragColor;

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

void main()
{
  _FragColor = ( 1 + normalize( _Sender.Nor ) ) / 2;
}

//##############################################################################
